Documents/ПокупкаПродажаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПокупкаПродажаВалюты</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаПокупкуПродажуВалюты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.БракВПроизводстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПокупкаПродажаВалюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаГривневая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВалютная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссионные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПенсионный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатратКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1ЗатратКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2ЗатратКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3ЗатратКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходовКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1ДоходовКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2ДоходовКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3ДоходовКурсоваяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатратКомиссионные</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1ЗатратКомиссионные</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2ЗатратКомиссионные</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3ЗатратКомиссионные</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатратПенсионный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1ЗатратПенсионный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2ЗатратПенсионный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3ЗатратПенсионный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатратСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1ЗатратСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2ЗатратСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3ЗатратСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходовСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1ДоходовСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2ДоходовСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3ДоходовСебестоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяВаловыхРасходов</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяВаловыхДоходов</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяВаловыхРасходовКомиссионные</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПокупкуПродажуВалюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидНалоговойДеятельности</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяВаловыхРасходовПенсионный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ШкалаСтавокНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШкалаСтавокНалогов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяНалоговойДекларации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПолная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПорога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиШкалыСтавокНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПокупкаПродажаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПокупкаПродажаВалюты</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПокупкаПродажаВалюты/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ПересчитатьСуммы() Экспорт;
	
	СрезНалогов = РегистрыСведений.ШкалаСтавокНалогов.ПолучитьПоследнее(Дата, Новый Структура("Налог",Справочники.Налоги.ПенсионныйВалюта));
	
	Если ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПокупкаВалюты Тогда
		СуммаПенсионныйНовый = СуммаГривневая*СрезНалогов.Ставка;
		Если СуммаПенсионныйНовый <> СуммаПенсионный Тогда
			СуммаПенсионный = СуммаГривневая*СрезНалогов.Ставка;
		КонецЕсли;
		СуммаДокументаНовая = СуммаГривневая + СуммаКомиссионные + СуммаПенсионный;
		Если СуммаДокумента <> СуммаДокументаНовая Тогда
			СуммаДокумента = СуммаДокументаНовая;
		КонецЕсли; 
	Иначе	
		Если СуммаПенсионный <> 0 Тогда
			СуммаПенсионный = 0;
		КонецЕсли;
		СуммаДокументаНовая = СуммаГривневая - СуммаКомиссионные;
		Если СуммаДокумента <> СуммаДокументаНовая Тогда
			СуммаДокумента = СуммаДокументаНовая;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьПоЗаявке() Экспорт
	
	ВидОперации = Заявка.ВидОперации;
	Организация = Заявка.Организация;
	Банк = Заявка.Банк;
	Валюта = Заявка.Валюта;
	СуммаГривневая = Заявка.СуммаГривневая;
	СуммаВалютная = Заявка.СуммаВалютная;
	СуммаКомиссионные = Окр(Заявка.СуммаГривневая*Заявка.Комиссионные/100,2);
	ПересчитатьСуммы();
	
КонецПроцедуры	


// Формирует движения по регистрам
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//  Режим 					  - режим проведения документа
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок);

КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ ОтражатьВБухгалтерскомУчете Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ПроводкиБУ	= Движения.Хозрасчетный;
	ПроводкиНУ  = Движения.Налоговый;
	
	Если ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПокупкаВалюты Тогда
		
		ДанныеОВалютеРегл   = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, Дата);
		ДанныеОВалюте		= МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, Дата);
		
		СуммаГривневаяНБУ = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаВалютная, Валюта, мВалютаРегламентированногоУчета,
													 ДанныеОВалюте.Курс, ДанныеОВалютеРегл.Курс, 
													 ДанныеОВалюте.Кратность, ДанныеОВалютеРегл.Кратность);
													 
		СуммаКР = СуммаГривневая - СуммаГривневаяНБУ;											 
		
		//1. Перебрасываем деньги между субсчетами "Деньги в пути"
		
		Проводка = ПроводкиБУ.Добавить();

		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание  = "Покупка валюты";

		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Банк);

        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
		
		Проводка.ВалютаДт        = Валюта;
		Проводка.ВалютнаяСуммаДт = СуммаВалютная;
		
		Проводка.Сумма  = СуммаГривневаяНБУ;
		
		//2. Комиссионные банка
		
		Если СуммаКомиссионные > 0 Тогда
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Комиссионные банка";

			Проводка.СчетДт      = СчетЗатратКомиссионные;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратКомиссионные);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратКомиссионные);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратКомиссионные);

	        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			
			Проводка.Сумма  = СуммаКомиссионные;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = Проводка.Сумма;
			КонецЕсли;

		КонецЕсли;	
		
		//3. Отчисление в пенсионный
		
		Если СуммаПенсионный > 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Начисление сбора в ПФ";
			
			Проводка.СчетДт      = СчетЗатратПенсионный;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратПенсионный);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратПенсионный);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратПенсионный);
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Налоги", Справочники.Налоги.ПенсионныйВалюта);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиНалоговыхДеклараций", Справочники.СтатьиНалоговыхДеклараций.НП_Р2ПФВалют);
			
			Проводка.Сумма  = СуммаПенсионный;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = Проводка.Сумма;
			КонецЕсли;
			
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Уменьшение задолженности перед ПФ";
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Налоги", Справочники.Налоги.ПенсионныйВалюта);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиНалоговыхДеклараций", Справочники.СтатьиНалоговыхДеклараций.НП_Р2ПФВалют);
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			
			Проводка.Сумма  = СуммаПенсионный;
			
		КонецЕсли;
		
		//4. Курсовая разница
		Если СуммаКР > 0 Тогда
			
			// уплатили больше, чем зачислили в качестве покрытия купленной валюты - расходы
		
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Расходы: разница курсов покупки и НБУ";

			Проводка.СчетДт      = СчетЗатратКурсоваяРазница;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратКурсоваяРазница);

	        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			
			Проводка.Сумма  = СуммаКР;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = Проводка.Сумма;
			КонецЕсли;
			
		ИначеЕсли СуммаКР < 0 Тогда
			// уплатили меньше, чем зачислили в качестве покрытия купленной валюты - доходы
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Доходы: разница курсов покупки и НБУ";

	        Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Банк);

			Проводка.СчетКт      = СчетДоходовКурсоваяРазница;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Субконто1ДоходовКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Субконто2ДоходовКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Субконто3ДоходовКурсоваяРазница);

			Проводка.Сумма  = -СуммаКР;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетКт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПродажаВалюты Тогда
		
		ДанныеОВалютеРегл   = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, Дата);
		ДанныеОВалюте		= МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, Дата);
		
		СуммаГривневаяНБУ = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаВалютная, Валюта, мВалютаРегламентированногоУчета,
													 ДанныеОВалюте.Курс, ДанныеОВалютеРегл.Курс, 
													 ДанныеОВалюте.Кратность, ДанныеОВалютеРегл.Кратность);
		РеестрОстатков=РегистрыБухгалтерии.Хозрасчетный;

		СтруктураОтбора = Новый Структура("Счет",ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте);
		СтруктураОтбора.Вставить("Организация", Организация);
		СтруктураОтбора.Вставить("Валюта", Валюта);
		СтруктураОтбора.Вставить("Субконто1", Банк);
		
		Реквизиты = "Счет,Валюта,Субконто1";
				
		РеестрОстатков=РеестрОстатков.Остатки(Дата,,СтруктураОтбора,Реквизиты,"Сумма,ВалютнаяСумма");
		КурсПоСреднему =0;
		Для каждого Стр из РеестрОстатков цикл
			ОстатокВалРегУчета = Стр.СуммаОстатокДт-Стр.СуммаОстатокКт;
			ОстатокИнаяВал = Стр.ВалютнаяСуммаОстатокДт-Стр.ВалютнаяСуммаОстатокКт;
			КурсПоСреднему = ОстатокВалРегУчета/ОстатокИнаяВал;
		КонецЦикла;
		
		СуммаКР = Окр(СуммаВалютная*КурсПоСреднему,2) - СуммаГривневаяНБУ;
		СуммаРазницы = СуммаГривневая - СуммаГривневаяНБУ;
		
		Если Дата >= '20120101' Тогда
			//Алгоритм в соответствии с Приказом Минфина 1591
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = НСтр("ru='Продажа валюты';uk='Продаж валюти'",Локализация.КодЯзыкаИнформационнойБазы());

			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Банк);

	        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			
			Проводка.Сумма  		 = СуммаГривневая;
			Проводка.ВалютаКт        = Валюта;
			Проводка.ВалютнаяСуммаКт = СуммаВалютная;
			
			// Доход или расход от разницы курсов
			
			Если СуммаРазницы < 0 Тогда
				
				Проводка = ПроводкиБУ.Добавить();

				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Расходы на продажу валюты';uk='Витрати на продаж валюти'",Локализация.КодЯзыкаИнформационнойБазы());

				Проводка.СчетДт      = СчетЗатратСебестоимость;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратСебестоимость);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратСебестоимость);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратСебестоимость);
				
		        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
				Проводка.ВалютаКт    = Валюта;
				Проводка.Сумма  	 = - СуммаРазницы;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
					Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
					Проводка.СуммаНУДт = Проводка.Сумма;
				КонецЕсли;
				
			ИначеЕсли СуммаРазницы > 0 Тогда
		
				Проводка = ПроводкиБУ.Добавить();

				Проводка.Период      = Дата;
				Проводка.Организация = Организация;
				Проводка.Содержание  = НСтр("ru='Доходы от продажи валюты';uk='Доходи від продажу валюти'",Локализация.КодЯзыкаИнформационнойБазы());

		        Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Банк);
	            Проводка.ВалютаДт    = Валюта;
				
		        Проводка.СчетКт      = СчетДоходовСебестоимость;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Субконто1ДоходовСебестоимость);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Субконто2ДоходовСебестоимость);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Субконто3ДоходовСебестоимость);

				Проводка.Сумма  	 = СуммаРазницы;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетКт.НалоговыйУчет Тогда 
					Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
					Проводка.СуммаНУКт = Проводка.Сумма;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			//Алгоритм до Приказа Минфина 1591 (до 01.01.2012)
		
			//1. Ожидаемое поступление гривен
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = НСтр("ru='Продажа валюты';uk='Продаж валюти'",Локализация.КодЯзыкаИнформационнойБазы());

			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Банк);

	        Проводка.СчетКт      = СчетДоходовСебестоимость;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Субконто1ДоходовСебестоимость);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Субконто2ДоходовСебестоимость);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Субконто3ДоходовСебестоимость);
			
			Проводка.Сумма  = СуммаГривневая;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетКт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = ?(СуммаРазницы>0,СуммаРазницы,0);
			КонецЕсли;
			
			//2. Себестоимость валюты
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = НСтр("ru='Продажа валюты: Себестоимость валюты';uk='Продаж валюти: Собівартість валюти'",Локализация.КодЯзыкаИнформационнойБазы());

			
			Проводка.СчетДт      = СчетЗатратСебестоимость;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратСебестоимость);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратСебестоимость);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратСебестоимость);
			
	        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			
			Проводка.ВалютаКт        = Валюта;
			Проводка.ВалютнаяСуммаКт = СуммаВалютная;
			
			Проводка.Сумма  = СуммаГривневаяНБУ;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = ?(СуммаРазницы<0,-СуммаРазницы,0);
			КонецЕсли;
		КонецЕсли;
		
		//3. Комиссионные банка
		
		Если СуммаКомиссионные > 0 Тогда

			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Комиссионные банка";

			Проводка.СчетДт      = СчетЗатратКомиссионные;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратКомиссионные);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратКомиссионные);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратКомиссионные);

	        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			
			Проводка.Сумма  = СуммаКомиссионные;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли;	

		//4. Курсовая разница
		Если СуммаКР > 0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Расходы: разница курсов покупки и НБУ";

			Проводка.СчетДт      = СчетЗатратКурсоваяРазница;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Субконто1ЗатратКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Субконто2ЗатратКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Субконто3ЗатратКурсоваяРазница);

	        Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Банк);
			Проводка.ВалютаКт        = Валюта;
			
			Проводка.Сумма  = СуммаКР;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетДт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеДт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУДт = Проводка.Сумма;
			КонецЕсли;
			
		ИначеЕсли СуммаКР < 0 Тогда
	
			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Доходы: разница курсов покупки и НБУ";

	        Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Банк);
            Проводка.ВалютаДт        = Валюта;
			
			Проводка.СчетКт      = СчетДоходовКурсоваяРазница;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Субконто1ДоходовКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Субконто2ДоходовКурсоваяРазница);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Субконто3ДоходовКурсоваяРазница);

			Проводка.Сумма  = -СуммаКР;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 И Проводка.СчетКт.НалоговыйУчет Тогда 
				Проводка.НалоговоеНазначениеКт = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;

	ТаблицаЗатрат = Новый ТаблицаЗначений;
	ТаблицаЗатрат.Колонки.Добавить("Подразделение");
	ТаблицаЗатрат.Колонки.Добавить("СтатьяЗатрат");
	ТаблицаЗатрат.Колонки.Добавить("НоменклатурнаяГруппа");
	ТаблицаЗатрат.Колонки.Добавить("СуммаУпр");

	СуммаЗатратУпр = 0;
		
	ДанныеОВалютеРегл   = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, Дата);
	ДанныеОВалюте		= МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, Дата);
		
	СуммаГривневаяНБУ = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаВалютная, Валюта, мВалютаРегламентированногоУчета,
												 ДанныеОВалюте.Курс, ДанныеОВалютеРегл.Курс, 
												 ДанныеОВалюте.Кратность, ДанныеОВалютеРегл.Кратность);
	
	Если ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПокупкаВалюты Тогда
													 
		//1. Курсовая разница
		СуммаЗатратУпр = СуммаЗатратУпр + СуммаГривневая - СуммаГривневаяНБУ;											 
		
		//2. Комиссионные банка
		Если СуммаКомиссионные > 0 Тогда
			СуммаЗатратУпр = СуммаЗатратУпр + СуммаКомиссионные;
		КонецЕсли;	
		
		//3. Отчисление в пенсионный
		Если СуммаПенсионный > 0 Тогда
			СуммаЗатратУпр = СуммаЗатратУпр + СуммаПенсионный;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПродажаВалюты Тогда
		
		//1. Курсовая разница
		СуммаЗатратУпр = СуммаЗатратУпр + СуммаГривневаяНБУ -  СуммаГривневая;													 
		
		//2. Комиссионные банка
		Если СуммаКомиссионные > 0 Тогда
  			СуммаЗатратУпр = СуммаЗатратУпр + СуммаКомиссионные;
		КонецЕсли;	
		
	КонецЕсли;	
	
	
	Если СуммаЗатратУпр <> 0 Тогда
		//// при наличии затрат по упр. учету должны быть заполнены реквизты Подразделение и СтатьяЗатрат, если затрат нет, то заполнение не проверяем
		//Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Подразделение) Тогда
		//	ОбщегоНазначения.ОшибкаПриПроведении("Не заполнено значение реквизита Подразделение (затраты по упр. учету)", Отказ, Заголовок);
		//КонецЕсли; 
		//Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.СтатьяЗатрат) Тогда
		//	ОбщегоНазначения.ОшибкаПриПроведении("Не заполнено значение реквизита Статья затрат (затраты по упр. учету)", Отказ, Заголовок);
		//КонецЕсли; 
		//
		//Если Отказ Тогда
		//	Возврат;
		//КонецЕсли; 
	КонецЕсли; 
	
	// Заполним таблицу затрат
	СтрокаЗатрат = ТаблицаЗатрат.Добавить();

	СтрокаЗатрат.Подразделение 			= СтруктураШапкиДокумента.Подразделение;
	СтрокаЗатрат.СтатьяЗатрат 			= СтруктураШапкиДокумента.СтатьяЗатрат;
	СтрокаЗатрат.НоменклатурнаяГруппа 	= СтруктураШапкиДокумента.НоменклатурнаяГруппа;
	
	СтрокаЗатрат.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаЗатратУпр, мВалютаРегламентированногоУчета,
													СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
													1, 
													СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
													1, 
													СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
													
	СтруктДопПараметры = Новый Структура;
	СтруктДопПараметры.Вставить("КодОперацииНЗП", Перечисления.КодыОперацийНезавершенноеПроизводство.УслугиКонтрагентаНаПроизводство);
	
	// движения по затратам
	УправлениеЗатратами.ДвиженияПоПрочимЗатратамУпр(ЭтотОбъект, ТаблицаЗатрат, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, СтруктДопПараметры);
														
	
КонецПроцедуры

Функция СтруктураОбязательныхПолейШапки()

	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("Организация","Не указана организация!");
	СтруктураПолей.Вставить("Банк","Не указан уполномоченный банк!");
	СтруктураПолей.Вставить("Валюта","Не указана валюта документа!");
	
	Возврат СтруктураПолей;

КонецФункции // СтруктураОбязательныхПолейШапки()

Функция ДополнитьСтруктуруОбязательныхПолейШапкиРегл(СтруктураПолей)

	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат СтруктураПолей;
	КонецЕсли; 
	
	Если ВидОперации = Перечисления.ВидыОперацийПокупкаПродажаВалюты.ПокупкаВалюты Тогда
		СтруктураПолей.Вставить("СчетДоходовКурсоваяРазница","Не указан счет доходов по курсовой разнице!");
		СтруктураПолей.Вставить("СчетЗатратКурсоваяРазница","Не указан счет затрат по курсовой разнице!");
		СтруктураПолей.Вставить("СчетЗатратПенсионный","Не указан счет затрат по расчетам с ПФ!");
	Иначе
		СтруктураПолей.Вставить("СчетЗатратСебестоимость","Не указан счет затрат по себестоимости валюты!");
		СтруктураПолей.Вставить("СчетДоходовСебестоимость","Не указан счет доходов по себестоимости валюты!");
	КонецЕсли;
	
	СтруктураПолей.Вставить("СчетЗатратКомиссионные","Не указан счет затрат по комиссионным!");
	
	Возврат СтруктураПолей;

КонецФункции // ДополнитьСтруктуруОбязательныхПолейШапкиРегл()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаПокупкуПродажуВалюты") Тогда
	
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		Заявка = Основание;
		ЗаполнитьПоЗаявке();
		
	КонецЕсли;
		
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета"                  , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета"              , "КурсВалютыУправленческогоУчета");
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыльДо2015,ЕстьНДС,ЕстьЕдиныйНалог");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	ОбязательныеПоляШапки = СтруктураОбязательныхПолейШапки();
	ОбязательныеПоляШапки = ДополнитьСтруктуруОбязательныхПолейШапкиРегл(ОбязательныеПоляШапки);

	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, ОбязательныеПоляШапки, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
